perf-tests/results_new_20260420_151648/vt/ab_customer_summary_50k.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Completed 20000 requests
Completed 25000 requests
Completed 30000 requests
Completed 35000 requests
Completed 40000 requests
Completed 45000 requests
Completed 50000 requests
Finished 50000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8081

Document Path:          /customer-summary?id=c1
Document Length:        1170 bytes

Concurrency Level:      100
Time taken for tests:   4.971 seconds
Complete requests:      50000
Failed requests:        0
Total transferred:      63750000 bytes
HTML transferred:       58500000 bytes
Requests per second:    10058.09 [#/sec] (mean)
Time per request:       9.942 [ms] (mean)
Time per request:       0.099 [ms] (mean, across all concurrent requests)
Transfer rate:          12523.50 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.3      1      38
Processing:     0    9  39.8      6     895
Waiting:        0    8  39.5      5     894
Total:          0   10  39.8      7     895

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      9
  75%     10
  80%     11
  90%     13
  95%     16
  98%     22
  99%     38
 100%    895 (longest request)